from bot.messages.environment import environment

START = """
Вітаємо вас у боті для реєстрації на івенти!
"""

REGISTER = """
Для того щоб побачити список івентів потрібно спочатку пройти коротку реєстрацію.
"""

START_FORM = """
Для реєстрації на події, потрібно пройти авторизацію. Введи своє ПІБ:
"""

INPUT_FACULTY = """
<b>Твій факультет: </b>
(Якщо не з КПІ постав “-” або напиши свій ВНЗ)
"""

INPUT_GROUP = """
<b>Твоя група: </b>
(Якщо не з КПІ постав “-”)
"""

CONFIRM_INPUT = environment.from_string("""
ПІБ: {{ fullname }}
Факультет: {{ faculty }}
Група: {{ group }}
    
Правильно?
""")

RESET_FORM = """
Почнемо все спочатку. Як твоє ПІБ?
"""

SUCCESS_FORM = """
Дякуємо за реєстрацію
"""